ЕРПУХАстенд.cbr_Основной/src/Documents/ВерсияСоглашенияКоммерческийДоговор/ВерсияСоглашенияКоммерческийДоговор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6f86c206-9db7-48b7-b4ae-bd0b6755cf42">
  <name>ВерсияСоглашенияКоммерческийДоговор</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="cc84f655-ebf2-4ebb-be8b-3401593eb30f">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c4598031-283a-43bc-b288-e876e0c35525">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ВерсияСоглашенияКоммерческийДоговор/Forms/ФормаВыбора/Module.bsl
#Область СлужебныеПроцедурыИФункции
&После("ПриСозданииНаСервере")
&НаСервере
Процедура cbr_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ cbr-larkovgeorg 12.02.2026 ПРД12
	Если Параметры.Свойство("АгентскоеВознаграждение") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Ссылка КАК Ссылка,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.ПометкаУдаления КАК ПометкаУдаления,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Номер КАК Номер,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Дата КАК Дата,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Проведен КАК Проведен,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Сумма КАК Сумма,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Организация КАК Организация,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Ссылка = ДокументВерсияСоглашенияКоммерческийДоговор.ДоговорКонтрагента.ВерсияСоглашения КАК
		|		АктуальныйГрафик,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.НаименованиеВерсии КАК НаименованиеВерсии,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.НомерДополнительногоСоглашения КАК НомерДополнительногоСоглашения,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.ВерсияСоглашенияКоммерческийДоговор КАК ДокументВерсияСоглашенияКоммерческийДоговор
		|ГДЕ
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Организация = &Организация
		|	И ДокументВерсияСоглашенияКоммерческийДоговор.Контрагент = &Контрагент";
		
		Список.ТекстЗапроса = ТекстЗапроса;
		Список.ОсновнаяТаблица = "Документ.ВерсияСоглашенияКоммерческийДоговор";
		Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Отбор.Организация);
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Отбор.Контрагент);
	
	КонецЕсли;
	//-- cbr-larkovgeorg 12.02.2026 ПРД12
КонецПроцедуры
#КонецОбласти
